#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include "ChoosSortFill.h"

int main()
{
    printf("%c[%d;%dm░██████╗░█████╗░██████╗░████████╗██╗███╗░░██╗░██████╗░  ░█████╗░███╗░░██╗  ░█████╗░██████╗░██████╗░░█████╗░██╗░░░██╗%c[m\n", 27, 1, 31, 27);
    printf("%c[%d;%dm██╔════╝██╔══██╗██╔══██╗╚══██╔══╝██║████╗░██║██╔════╝░  ██╔══██╗████╗░██║  ██╔══██╗██╔══██╗██╔══██╗██╔══██╗╚██╗░██╔╝%c[m\n", 27, 0, 33, 27);
    printf("%c[%d;%dm╚█████╗░██║░░██║██████╔╝░░░██║░░░██║██╔██╗██║██║░░██╗░  ███████║██╔██╗██║  ███████║██████╔╝██████╔╝███████║░╚████╔╝░%c[m\n", 27, 0, 32, 27);
    printf("%c[%d;%dm ╚═══██╗██║░░██║██╔══██╗░░░██║░░░██║██║╚████║██║░░╚██╗  ██╔══██║██║╚████║  ██╔══██║██╔══██╗██╔══██╗██╔══██║░░╚██╔╝░░%c[m\n", 27, 0, 36, 27);
    printf("%c[%d;%dm██████╔╝╚█████╔╝██║░░██║░░░██║░░░██║██║░╚███║╚██████╔╝  ██║░░██║██║░╚███║  ██║░░██║██║░░██║██║░░██║██║░░██║░░░██║░░░%c[m\n", 27, 0, 34, 27);
    printf("%c[%d;%dm╚═════╝░░╚════╝░╚═╝░░╚═╝░░░╚═╝░░░╚═╝╚═╝░░╚══╝░╚═════╝░  ╚═╝░░╚═╝╚═╝░░╚══╝  ╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝╚═╝░░╚═╝░░░╚═╝░░░%c[m\n", 27, 0, 35, 27);
    int var;
    int b;
    int sor;
    printf("\033[1;37;40mВыберите вариант заполнения масива:\033[m\n");
    printf("\033[3;30;47m 1-Датчик случайных чисел;\033[m\n");
    printf("\033[3;37;40m 2-Ввод с клавиатуры;\033[m\n");
    printf("\033[3;30;47m 3-Заполнение из файла;\033[m\n");
    scanf("%d", &var); //выбор заполнения массива
    printf("\033[1;37;40mВведите размер массива:\033[m\n");
    scanf("%d", &b); //кол-во эл в массиве
    int a[b];
    srand(time(NULL));
    ChoiceArray(a, b, var);
    printf("\n\033[1;37;40mВыберите сортировку:\033[m\n");
    printf("\033[3;30;40m 1-Пузырьковая сортировка:\033[m\n");
    printf("\033[3;30;47m 2-Шейкерная сортировка:\033[m\n");
    printf("\033[3;37;40m 3-Сортировка простым включением:\033[m\n");
    printf("\033[3;30;47m 4-Сортировка методом простого выбора:\033[m\n");
    printf("\033[3;37;40m 5-Сортировка Шелла:\033[m\n");
    scanf("%d", &sor); //выбор сортировки
    ChoiceSor(a, b, sor);
    printf("\n");
}
